/*
按位与 &:
将两个整数的二进制表示按位进行与运算,只有当相应的二进制位都为1时,结果才为1,否则结果为0
即：
	1&1-> 1
	1&0-> O
	0&1-> O
	0&0-> O
int a = 32;
int b = 25;

System. out. printIn (a & b) ; // 0
a的二进制: 00100000
b的二进制: 00011001
按位与之后:00000000

*/
public class OperatorTest08{
	public static void main(String[] args){
	
		// 00100011
		int a = 35;
		// 00011010
		int b = 26;
			/*
			00100011
		&	00011010
		--------------
			00000010
			*/
		System.out.println(a & b); // 2

		/*
		判断一个数是否为奇数？
			用任何数和数字1进行按位与运算 结果为1，表示是奇数
		*/
		int num = 35;
		/*		
			00100011
		&	00000001
		--------------
			00000001
		*/
		if ((num & 1) == 1)
		{
			System.out.println(num + "是奇数");
		}


	}
}