/*
按位取反~
将整数的二进制表示按位进行取反运算,
即0变为1,1变为0

System.out.println (~100); // -101
100的二进制:   01100100
取反后:		   10011011(这是一个补码哦)
将补码转为原码:11100101 (-101)
*/
public class OperatorTest11{
	public static void main(String[] args){
		
		int a = 10;//00001010
		/*
		取反：
		11111111 11111111 11111111 11110101(补码)
		10000000 00000000 00000000 00001011(补码取反加1=原码)
		*/
		System.out.println(~a);//11

		//按位取反的具体应用：将某个2进制位清0
		int value = 0b1111111111;//待清0的数据
		//将低位第四位清0
		int flag = (1 << 3);
		//flag -->  00000000 00000000 00000000 00001000
		//~flag --> 11111111 11111111 11111111 11110111
		
		//value -->      00000000 00000000 00000011 11111111
		//   & (~flag) =>11111111 11111111 11111111 11110111
		//			   ------------------------------------
		//				 00000000 00000000 00000011 11110111 <-- (比对这个数字和value：第四位清0了)
		value = value & (~flag);
		System.out.println(value);
	}
}