/*
无符号右移 >>>
它能够将一个二进制数的所有位向右移动指定的位数,而不考虑符号位。
无符号右移运算符的运算规则如下:
1. 将二进制数右移n位,相当于将数值除以2的n次方,并将最高位填充为0。
2. 任意一个数字经过无符号右移之后,最终结果一定是非负数(0或正整数)
3. 无符号右移运算符对溢出进行截断。
*/
public class OperatorTest07{
	public static void main(String[] args){
		/*
			原码:10000000
			反码:11111111
				 10000000(补码)
				 00100000(无符号右移2位)	
		*/
		byte a = -128;
		/*
		为什么输出结果不是32?
				b >>> 2.
			byte和int混合运算。会先将byte转换成int,再做运算。

			int b = -128;
			原码:10000000 00000000 00000000 10000000
			反码:11111111 11111111 11111111 01111111
			补码:11111111 11111111 11111111 10000000
			右移:0011111111 11111111 11111111 100000(补码)
		*/
		
		System.out.println(a >>> 2 );//1073741792
		
		// 11100000(补码)(强转成byte 相当于上面的右移后的代码砍掉前三个字节，保留最后8bit)
		// 10100000(原码)
		System.out.println((byte)(a>>>2)); // -32

		/*

		原码:10000000 00000000 00000000 01011010
		反码:11111111 11111111 11111111 10100101
		补码:11111111 11111111 11111111 10100110
		右移:00011111111 11111111 11111111 10100
		*/
		int x = -90;
		System.out.println(x >>> 3);
		System.out.println(0b00011111111111111111111111110100);


	}
}