/*
右移运算符 >>
1.将二进制右移n位 相当于将数值除以2的n次方
2.右移运算符对正数，负数，0的处理方式不同
	正数：符号位不变 右移时左补0
	负数：符号位不变 右移时左补1
	0：右移时结果仍为0
3.右移运算符会对溢出进行截断

*/
public class OperatorTest06{
	public static void main(String[] args){
		/*
		原反补码：00000000 00000000 00000000 00000001
		右移1位：00000000 00000000 00000000 00000000
		*/
		int a = 1;
		System.out.println(a >> 1);//0
		
		/*
		原反补码：00000000 00000000 00000000 10000000
		右移4位：00000000 00000000 00000000 00001000
		*/
		int b = 128;
		System.out.println(b >> 4);//8
		
		/*
		原码：10000000 00000000 00000000 10000000
		反码：11111111 11111111 11111111 01111111
		补码：11111111 11111111 11111111 10000000
		右移4位：11111111 11111111 11111111 11111000
		转换为原码：10000000 00000000 00000000 00001000
		*/
		int c = -128;
		System.out.println(c >> 4);//-8



	}
}
